pmo-dataset/graphviz/12.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Adjust compensation" -> "ParallelGateway_3";
  "ExclusiveGateway_2" -> "ExclusiveGateway_5";
  "ParallelGateway_4" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Set new\nresponsibilities";
  "Set new\nresponsibilities" -> "ParallelGateway_3";
  "ExclusiveGateway_4" -> "Work on skill\nenhancement";
  "start" -> "Identify development\nneeds or career\naspirations";
  "ExclusiveGateway_6" -> "ParallelGateway_1";
  "ExclusiveGateway_5" -> "Receive feedback and\nevaluation from\nsupervisors";
  "Transition into new\nrole" -> "ExclusiveGateway_3";
  "ParallelGateway_3" -> "Transition into new\nrole";
  "Conducts formal\nperformance review" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "Adjust compensation";
  "ExclusiveGateway_3" -> "end";
  "Work on skill\nenhancement" -> "ExclusiveGateway_6";
  "ExclusiveGateway_1" -> "Approve promotion";
  "Approve promotion" -> "ParallelGateway_2";
  "ParallelGateway_4" -> "ExclusiveGateway_5";
  "ExclusiveGateway_6" -> "ExclusiveGateway_4";
  "ExclusiveGateway_1" -> "ExclusiveGateway_3";
  "Consider employee\nfor promotion or new\nrole" -> "Conducts formal\nperformance review";
  "Receive feedback and\nevaluation from\nsupervisors" -> "ExclusiveGateway_2";
  "Create personal\ndevelopment plan" -> "ParallelGateway_4";
  "ExclusiveGateway_2" -> "ParallelGateway_1";
  "Identify development\nneeds or career\naspirations" -> "Create personal\ndevelopment plan";
  "ParallelGateway_1" -> "Consider employee\nfor promotion or new\nrole";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
