pmo-dataset/mermaid/12.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	Task_7["Adjust compensation"] --> ParallelGateway_3{"+"}
	ExclusiveGateway_2{"X"} --> ExclusiveGateway_5{"X"}
	ParallelGateway_4{"+"} --> ExclusiveGateway_4{"X"}
	ParallelGateway_2{"+"} --> Task_10["Set new\nresponsibilities"]
	Task_10 --> ParallelGateway_3
	ExclusiveGateway_4 --> Task_6["Work on skill\nenhancement"]
	StartNoneEvent_1(("start")) --> Task_5["Identify development\nneeds or career\naspirations"]
	ExclusiveGateway_6{"X"} --> ParallelGateway_1{"+"}
	ExclusiveGateway_5 --> Task_8["Receive feedback and\nevaluation from\nsupervisors"]
	Task_1["Transition into new\nrole"] --> ExclusiveGateway_3{"X"}
	ParallelGateway_3 --> Task_1
	Task_4["Conducts formal\nperformance review"] --> ExclusiveGateway_1{"X"}
	ParallelGateway_2 --> Task_7
	ExclusiveGateway_3 --> EndNoneEvent_1(("end")):::endEvent
	Task_6 --> ExclusiveGateway_6
	ExclusiveGateway_1 --> Task_9["Approve promotion"]
	Task_9 --> ParallelGateway_2
	ParallelGateway_4 --> ExclusiveGateway_5
	ExclusiveGateway_6 --> ExclusiveGateway_4
	ExclusiveGateway_1 --> ExclusiveGateway_3
	Task_3["Consider employee\nfor promotion or new\nrole"] --> Task_4
	Task_8 --> ExclusiveGateway_2
	Task_2["Create personal\ndevelopment plan"] --> ParallelGateway_4
	ExclusiveGateway_2 --> ParallelGateway_1
	Task_5 --> Task_2
	ParallelGateway_1 --> Task_3
